# GetPoints Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Polyloop..::..GetPoints Method
Polyloop Class See Also
---
Gets the array of points in the polygon.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<XYZ> GetPoints()
```

Visual Basic
---
```text
Public Function GetPoints As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetPoints()
```

# ### Return Value
The array of points in the polygon.
# See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace